//------------------------------------------------------------------------------
//  初期化
//------------------------------------------------------------------------------
$(function()
{
    init();
});

//------------------------------------------------------------------------------
//  コントローラー
//------------------------------------------------------------------------------
function init()
{
    //  ダイアログ初期化（ゲーム説明）
    $("#dlg_description").dialog(
    {
        autoOpen: false,
        modal: true,
        width: 480,
        resizable: false,
        buttons:
        {
            "閉じる": function()
            {
                $(this).dialog("close");
            }
        }
    });

    //  説明ボタン押下
    $('#btn_description').on('click', function()
    {
        open_description();
    });

    //  スタートボタン押下
    $('#btn_start').on('click', function()
    {
        game_start();
    });
}

//------------------------------------------------------------------------------
//  説明ポップアップ表示 関数
//------------------------------------------------------------------------------
function open_description()
{
    $('#dlg_description').dialog("open");
}

//------------------------------------------------------------------------------
//  ゲーム画面遷移 関数
//------------------------------------------------------------------------------
function game_start()
{
    // ルート直下の index.html から見た game.html への相対パスに修正
    location.href = "./app/views/front/game.html";
}